<?php


error_reporting(0); // яйпшрхе ньханй


// ______________ ондйкчвемхе й аюге _______________________________


$db=mysqli_connect("localhost","root","","zendloto"); // уняр, чгеп, оюпнкэ, аюгю


if(mysqli_connect_errno()){ echo 'оНОПЮБХРЭ ОНДЙКЧВЕМХЕ Й АЮГЕ'; exit; }
mysqli_query($db,"SET NAMES 'cp1251'");


$ssl='0'; // еякх сярюмнбкем SSL (https://), рн 1, хмюве 0
if($ssl==1){ $https='https'; }
else{ $https='http'; }


$start_data='22.05.2018 10:00'; // дюрю ярюпрю
$time_move=0; // вюянбни онъя +- вюяш
date_default_timezone_set('Europe/Moscow') or die('no time_zone'); // бпелъ лняйбш


$admin_id=1; // мнлеп UID юдлхмю хг аюгш дюммшу б рюакхже USERS
$admin_pass='zend'; // оюпнкэ б юдлхмйс. хг юмцкхияйху асйб хкх жхтп

$admin_ip=array(); // менаъгюрекэмн. яохянй бюьху IP дкъ убндю б юдлхмйс б ярнкахй. еякх лнфмн бундхрэ я кчанцн IP, рн ме ярюбэре
/* мюопхлеп с бюя 2 IP
$admin_ip[]='127.0.0.1';
$admin_ip[]='189.43.20.140';
*/


$p_hash='45635345'; // наъгюрекэмн ялемхрэ мю дпсцне хг жхтп хкх асйб. ьхтп дкъ опнтхкеи.


$admin_up=1; // пюгпеьхрэ юдлхмс гювхякърэ опнкеребьее ононкмемхе свюярмхйс б ецн опнтхке. 0 - мер, 1 - дю.
$admin_pb=1; // пюгпеьхрэ юдлхмс лемърэ аюкюмя свюярмхйю б ецн опнтхке. 0 - мер, 1 - дю.
$admin_wa=1; // пюгпеьхрэ юдлхмс хглемърэ йньекей свюярмхйю б ецн опнтхке. 0 - мер, 1 - дю.
$admin_pm=1; // пюгпеьхрэ юдлхмс нропюбкърэ бяокшбючыее яннаыемхе онкэгнбюрекч б ецн опнтхке. 0 - мер, 1 - дю.


$im_max_m=20; // люйяхлюкэмне йнкхвеярбн яннаыемхи нр онкэгнбюрекъ б оепеохяйе гю 1 вюя - гюыхрю нр яоюлепнб.


$on_time=30; // вепег яйнкэйн лхмср сдюкърэ чгепю хг яохяйх нмкюим, еякх меюйрхбем. (ме хг юййюсмрю)


$noip_1=1; // пецхярпюжхъ я ндмнцн IP. 0 - пюгпеьемю, 1 - гюопеыемю
$noip_2=1; // бунд я ндмнцн IP. йнцдю опх пецхярпюжхх лемъчр IP, ю онрнл бундър б нярюкэмше юййюсмрш я мюярнъыхл IP. 0 - пюгпеьем, 1 - гюопеыем
$noip_3=1; // пецхярпюжхъ я IP нркхвючыецняъ мю 1-3 жхтпш б йнмже. 0 - пюгпеьемю, 1 - гюопеыемю
// мюйпсрвхйх пецхярпхпсчряъ, лемъъ оюпс жхтп б йнмже: 127.0.0.100, 127.0.0.101, 127.0.0.2, 127.0.0.194
$many_nets=1; // пецхярпюжхъ я меяйнкэйху янжяереи. 0 - пюгпеьемю, 1 - гюопеыемю
// дкъ пецхярпюжхх ябнху днонкмхрекэмшу юййюсмрнб, онярюбэре $noip_1=0; $noip_2=0; $noip_3=0; $many_nets=0; б йнмже бепмхре ху напюрмн
// гюпецхярпхпсиреяэ, гюрел б аюге б users мюидхре щрнр юййюсмр, яйнохпсире ецн б яохянй мхфе, аег онякедмеи гюоърни.
// еякх с бюя 3 юййюсмрю, рн асдер, мюопхлеп, рюй: $my_ids=array(1,5,42);
$my_uids=array(1);


$d_mess_old=12441600; // сдюкърэ яннаыемхъ оепеохяйх ярюпее щрнцн гмювемхъ б яейсмдсюу. 12441600 - онкцндю
$h_time=7; // яйнкэйн дмеи упюмхрэ яохянй оепедюммшу дюммшу онкэгнбюрекълх хг рюакхжш request. врнаш мюирх йрн ошрюкяъ бгкнлюрэ
$rp_time=31; // яйнкэйн дмеи упюмхрэ хярнпхч петепюкэмшу мювхякемхи
$last_w_c=7; // яйнкэйн онякедмху бшокюр онйюгшбюрэ б ярюрхярхйе


$up_min_sum=2; // лхмхлюкэмюъ ясллю ононкмемхъ
$w_bonus_reg=1; // ямхлюрэ анмсямше демэцх, онксвеммше опх пецхярпюжхх (опх оепбнл бшбнде). 1 - дю, 0 - мер
$w_to_b_up=0; // мю йюйсч ясллю мюдн ононкмхрэ, врнаш лнфмн ашкн бшбндхрэ. еякх ме мюдн, рн ярюбхл 0
$w_time=0; // вепег йюйне бпелъ лнфмн гюйюгюрэ якедсчысч бшокюрс (б яейсмдюу). еякх вепег 24 вюяю, рн $w_time=86400;


$reg_mode=0; // 0 - пецхярпюжхъ вепег ULOGIN.RU, 1 - пецхярпюжхъ мюопълсч (мюдн яюлнлс ондйкчвхрэ йюфдсч янжяерэ. мхмярпсйжхх еярэ)

$bonus_reg=0.2; // анмся опх пецхярпюжхх


// ______________ пюгдек "онксвхрэ анмся" _______________________________


$bonus_gif_items=20; // йнкхвеярбн нрнапюфюелшу анмсянб
$bonus_gif_min=10; // лхмхлюкэмши анмся б йноеийюу
$bonus_gif_max=100; // люйяхлюкэмши анмся б йноеийюу
$bonus_gif_time=72000; // вепег яйнкэйн яейсмд лнфмн онксвхрэ анмся еы╗ пюг. 86400 - 24 ВЮЯЮ, 72000 - 20 ВЮЯНБ, 3600 - 1 ВЮЯ
$bonus_gif_text='аНМСЯ БШДЮ╦РЯЪ 1 ПЮГ Б 20 ВЮЯНБ.'; // рейяр
$bonus_gif_g=1; // 0 - анмся онксвючр бяе опнярн рюй
// 1 - рнкэйн ре, йрн ондохяюмш мю цпсоос бй
// 2 - ре йрн бньек я бй - днкфмш ондохяюрэяъ, ю нярюкэмше янжяерх онксвючр опнярн рюй
// 3 - ре йрн бньек я бй - днкфмш опнярн ондохяюрэяъ, ю нярюкэмше янжяерх онксвюр рнкэйн еякх ононкмър аюкюмя $bonus_gif_up=0;
$bonus_gif_up=0; // мю яйнкэйн днкфем ононкмхрэ аюкюмя онкэгнбюрекэ, врнаш онксвюрэ анмся
$bonus_gif_bet_time=86400; // дюбюрэ анмся рнкэйн еякх ядекюк унрэ ндмс ярюбйс б ревемхх сйюгюммнцн бпелемх б яейсмдюу. еякх ме мсфмн, рн ярюбхл 0
$bonus_gif_bet_sum=0.10; // х йюйюъ ясллю днкфмю ашрэ мю аюкюмяе, врнаш ялнц ядекюрэ ярюбйс. рн еярэ ме лемэье, вел лхмхлюкэмюъ ярюбйю б кнрн


// ______________ йньек╗й PAYEER _______________________________


$accountNumber='P****'; // мнлеп йньекэйю
$m_shop='****'; // ID люцюгхмю
$m_key='****'; // дкъ ононкмемхъ яейпермши йкчв
$apiId='****'; // дкъ бшокюр API ID
$apiKey='****'; // дкъ бшокюр яейпермши йкчв


// ______________ йньек╗й FREE-KASSA _______________________________


$fk_id='****'; // ID люцюгхмю (лепвюмрю)
$fk_secret='****'; // яейпермши йкчв
$fk_secret_2='****'; // яейпермши йкчв 2
$fk_wallet_id='****'; // F йньек╗й дкъ бшокюр
$fk_api_key='****'; // API KEY дкъ бшокюр вепег F йньек╗й
$fk_mode=1; // оепебндхрэ я аюкюмяю мю F йньек╗й дкъ бшокюр. 0 - мер, 1 - дю


// наъгюрекэмн. йнлхяяхх дкъ бшбндю вепег FREE-KASSA. лнцср лемърэяъ. ялнрпхл рср https://www.fkwallet.ru/docs#wallet_cashout

$fk_payeer=5; // йнлхяяхъ опх бшбнде мю PAYEER
$fk_yandex=0; // йнлхяяхъ опх бшбнде мю ъмдейя.демэцх
$fk_qiwi=5;   // йнлхяяхъ опх бшбнде мю QIWI


// ______________ ODNOKLASSNIKI дюммше опхкнфемхъ дкъ бундю _______________________________


$ok_id='123456'; // ID опхкнфемхъ
$ok_key='123456'; // осакхвмши йкчв опхкнфемхъ
$ok_secret='123456'; // яейпермши йкчв опхкнфемхъ
$ok_url=$https.'://'.$_SERVER['HTTP_HOST'].'/pages/login.php?network=odnoklassniki'; // ме рпнцюрэ


// ______________ FACEBOOK дюммше опхкнфемхъ дкъ бундю _______________________________


$fb_id='123456'; // ID опхкнфемхъ
$fb_secret='123456'; // яейпермши йкчв
$fb_url=$https.'://'.$_SERVER['HTTP_HOST'].'/pages/login.php?network=facebook'; // ме рпнцюрэ


// ______________ VKONTAKTE дюммше опхкнфемхъ дкъ бундю _______________________________


$vk_id='123456'; // ID опхкнфемхъ
$vk_secret='123456'; // яейпермши йкчв
$vk_url=$https.'://'.$_SERVER['HTTP_HOST'].'/pages/login.php?network=vkontakte'; // ме рпнцюрэ


// ______________ пюгмне _______________________________


$vk_group_id='123456'; // ID цпсоош бйнмрюйре
$vk_group_link='https://vk.com/public123456'; // яяшкйю мю цпсоос бйнмрюйре. еякх мер, рн яреперэ.
$vk_at=''; // йкчв днярсою нр яннаыеярбю
$ok_group_link='https://ok.ru/group/53789227221144'; // яяшкйю мю цпсоос б ндмнйкюяямхйюу. еякх мер, рн яреперэ.
$fb_group_link='https://www.facebook.com/'; // яяшкйю мю цпсоос б FACEBOOK. еякх мер, рн яреперэ.
$site_logo='<span class="head_logo_1">ZEND</span> <span class="head_logo_2">LOTO</span>'; // кнцн яюирю
$site_logo_under='ЯЕПБХЯ АШЯРПШУ КНРЕПЕИ'; // якнцюм яюирю
$site_email='support@zend-loto.com'; // онврю мю ярпюмхже "йнмрюйрш"
$news_copy='я СБЮФЕМХЕЛ, ЙНЛЮМДЮ "ZEND LOTO".'; // ондохяэ б мнбняръу


// ______________ мюярпнийю ярюмдюпрмшу йнлмюр _______________________________


$to_ref_1=5; // йнлхяяхъ петнбндс 1-цн спнбмъ ян ярюбйх опнхцпюбьецн петепепю
$to_ref_2=2; // йнлхяяхъ петнбндс 2-цн спнбмъ ян ярюбйх опнхцпюбьецн петепепю
$to_ref_3=1; // йнлхяяхъ петнбндс 3-цн спнбмъ ян ярюбйх опнхцпюбьецн петепепю


$room_dont=0; // мхфе йюйнцн опнжемрю ме свхршбюрэ ярюбйс опх бшанпе онаедхрекъ.
// мю яксвюи, еякх вюярн онаефдючр ре с йнцн ьюмя ашк 1-2% х хцпнйюл х бюл щрн ме мпюбхряъ - охьел мсфмши опнжемр


$room_first=0; // оняке яйнкэйх онаед гюйпшрэ йнлмюрс мнбхвйнб, врнаш нмх хцпюкх сфе он-йпсомнлс б дпсцху йнлмюрюу.

$room_wins=0; // 1 - бйкчвхрэ пефхл онаедхрекеи, 0 - бшйкчвхрэ. врнаш б юдлхмйе б мюярпнийюу пюанрюк осмйр
// "ID ОНЯРНЪММШУ ОНАЕДХРЕКЕИ Б НАШВМШУ ЙНЛМЮРЮУ"


$room=array();
// оепбюъ йнлмюрю
$room[1]['min']=0.10; // лхмхлюкэмюъ ясллю ярюбйх
$room[1]['max']=5; // люйяхлюкэмюъ ясллю ябнху ярюбнй
$room[1]['to_admin']=12; // йнлхяяхъ юдлхмс
$room[1]['users']=2; // оняке яйнкэйх хцпнйнб гюосяйюрэ рюилеп
$room[1]['text']='нРЯВЕР МЮВМЕРЯЪ ОНЯКЕ ДБСУ ЯРЮБНЙ'; // рейяр
$room[1]['timer']=30; // рюилеп
// брнпюъ йнлмюрю
$room[2]['min']=1; // лхмхлюкэмюъ ясллю ярюбйх
$room[2]['max']=200; // люйяхлюкэмюъ ясллю ябнху ярюбнй
$room[2]['to_admin']=12; // йнлхяяхъ юдлхмс
$room[2]['users']=2; // оняке яйнкэйх хцпнйнб гюосяйюрэ рюилеп
$room[2]['text']='нРЯВЕР МЮВМЕРЯЪ ОНЯКЕ ДБСУ ЯРЮБНЙ'; // рейяр
$room[2]['timer']=30; // рюилеп
// рперэъ йнлмюрю
$room[3]['min']=10; // лхмхлюкэмюъ ясллю ярюбйх
$room[3]['max']=2000; // люйяхлюкэмюъ ясллю ябнху ярюбнй
$room[3]['to_admin']=12; // йнлхяяхъ юдлхмс
$room[3]['users']=2; // оняке яйнкэйх хцпнйнб гюосяйюрэ рюилеп
$room[3]['text']='нРЯВЕР МЮВМЕРЯЪ ОНЯКЕ ДБСУ ЯРЮБНЙ'; // рейяр
$room[3]['timer']=30; // рюилеп


// ______________ мюярпнийю тхйяхпнбюммшу йнлмюр _______________________________


$fix_r_1=5; // йнлхяяхъ петнбндс 1-цн спнбмъ ян ярюбйх опнхцпюбьецн петепепю
$fix_r_2=2; // йнлхяяхъ петнбндс 2-цн спнбмъ ян ярюбйх опнхцпюбьецн петепепю
$fix_r_3=1; // йнлхяяхъ петнбндс 3-цн спнбмъ ян ярюбйх опнхцпюбьецн петепепю


// б аюге дюммшу янгдюмн 20 йнлмюр
// еякх йнлмюрю ме мсфмю - сдюкхре е╗ ярпнйх
// еякх йнлмюрю мсфмю - днаюбэре ярпнйх
// $fix[1] - 1 - мнлеп id йнлмюрш б аюге дюммшу б рюакхже room_fix


$fix=array();
// 1 йнлмюрю
$fix[1]['bet']=0.10; // ярюбйю
$fix[1]['players']=3; // бяецн свюярмхйнб
$fix[1]['winners']=1; // яйнкэйн кчдеи бшхцпючр
$fix[1]['to_admin']=12; // йнлхяяхъ юдлхмс
// 2 йнлмюрю
$fix[2]['bet']=0.20; // ярюбйю
$fix[2]['players']=3; // бяецн свюярмхйнб
$fix[2]['winners']=1; // яйнкэйн кчдеи бшхцпючр
$fix[2]['to_admin']=12; // йнлхяяхъ юдлхмс
// 2 йнлмюрю
$fix[3]['bet']=0.5; // ярюбйю
$fix[3]['players']=3; // бяецн свюярмхйнб
$fix[3]['winners']=1; // яйнкэйн кчдеи бшхцпючр
$fix[3]['to_admin']=12; // йнлхяяхъ юдлхмс
// 4 йнлмюрю
$fix[4]['bet']=1; // ярюбйю
$fix[4]['players']=3; // бяецн свюярмхйнб
$fix[4]['winners']=1; // яйнкэйн кчдеи бшхцпючр
$fix[4]['to_admin']=12; // йнлхяяхъ юдлхмс
// 5 йнлмюрю
$fix[5]['bet']=2; // ярюбйю
$fix[5]['players']=3; // бяецн свюярмхйнб
$fix[5]['winners']=1; // яйнкэйн кчдеи бшхцпючр
$fix[5]['to_admin']=12; // йнлхяяхъ юдлхмс
// 6 йнлмюрю
$fix[6]['bet']=4; // ярюбйю
$fix[6]['players']=3; // бяецн свюярмхйнб
$fix[6]['winners']=1; // яйнкэйн кчдеи бшхцпючр
$fix[6]['to_admin']=12; // йнлхяяхъ юдлхмс
// 7 йнлмюрю
$fix[7]['bet']=8; // ярюбйю
$fix[7]['players']=3; // бяецн свюярмхйнб
$fix[7]['winners']=1; // яйнкэйн кчдеи бшхцпючр
$fix[7]['to_admin']=12; // йнлхяяхъ юдлхмс
// 8 йнлмюрю
$fix[8]['bet']=16; // ярюбйю
$fix[8]['players']=3; // бяецн свюярмхйнб
$fix[8]['winners']=1; // яйнкэйн кчдеи бшхцпючр
$fix[8]['to_admin']=12; // йнлхяяхъ юдлхмс
// 9 йнлмюрю
$fix[9]['bet']=32; // ярюбйю
$fix[9]['players']=3; // бяецн свюярмхйнб
$fix[9]['winners']=1; // яйнкэйн кчдеи бшхцпючр
$fix[9]['to_admin']=12; // йнлхяяхъ юдлхмс
// 10 йнлмюрю
$fix[10]['bet']=64; // ярюбйю
$fix[10]['players']=3; // бяецн свюярмхйнб
$fix[10]['winners']=1; // яйнкэйн кчдеи бшхцпючр
$fix[10]['to_admin']=12; // йнлхяяхъ юдлхмс


// ______________ ярпюмхжш яюирю _______________________________


// ярпюмхжш бхдмше бяел
$inc=array('profile','contest_ref','contest_bet','faq','news','contacts','room','fix');
// ярпюмхжш дкъ бньедьху б юййюсмр
$inc_cab=array('cab','bonus','bup','w','refs','dialog');
// ярпюмхжш дкъ юдлхмю
$inc_adm=array('a_stat','a_users','a_options','a_rp','a_up','a_w','a_news_list','a_news_edit','im');


// ______________ яяшкйх мю опнтхкх янжяереи _______________________________


$profile_link=array();
$profile_link['vkontakte']='https://vk.com/id';
$profile_link['odnoklassniki']='https://ok.ru/profile/';
$profile_link['facebook']='https://www.facebook.com/app_scoped_user_id/';


// ______________ дюкее ме рпнцюрэ  _______________________________


$time=time()+$time_move*3600;


// ______________ room_status _______________________________


if(isset($_GET['room_status'])){


$r_q=mysqli_query($db,"SELECT * FROM room_status LIMIT 1") or die();
$r_m=mysqli_fetch_assoc($r_q);


foreach($r_m as $r_mi=>$r_mv){
if(preg_match('#room\_[0-9a-z]+$#',$r_mi)){
echo 'if(document.getElementById("head_'.$r_mi.'")!=null && document.getElementById("head_'.$r_mi.'").innerHTML!=\''.$r_mv.'\'){
document.getElementById("head_'.$r_mi.'").innerHTML=\''.$r_mv.'\'; }';
}
}


exit;
}


ini_set('session.use_cookies','On'); ini_set('session.use_trans_sid','Off'); ini_set('session.gc_maxlifetime',31536000);
ini_set('session.cookie_lifetime',31536000); session_set_cookie_params(31536000, '/');
ini_set('session.cookie_httponly',1); // гхыхрю нр йпюфх йсйх
if(preg_match('/ajax/',$_SERVER['REQUEST_URI']) || preg_match('/pages/',$_SERVER['REQUEST_URI'])){ ini_set('session.save_path','../ses/'); }
else{ ini_set('session.save_path','ses/'); }
session_start();


if(!isset($_SESSION)){ echo 'no session'; exit; }


// ______________ бшунд _______________________________


if(isset($_GET['exit']) && !empty($_SESSION['uid'])){
mysqli_query($db,"DELETE FROM online WHERE uid='".$_SESSION['uid']."'");
unset($_SESSION['uid']);
unset($_SESSION['sponsor']);
unset($_SESSION['admin_ip']);
}


$u_id=0;
if(!empty($_SESSION['uid']) && $_SESSION['uid']>0){
$u_id=$_SESSION['uid'];
}


if(empty($_SESSION['mobile'])){ $mobile=0; }
else{ $mobile=1; }


if($u_id>0){
$mydq=mysqli_query($db,"SELECT * FROM users WHERE uid='$u_id' LIMIT 1") or die('cant get mydm');
$mydm=mysqli_fetch_assoc($mydq);


if(empty($mydm)){
echo 'no my data found';
exit;
}


if($mydm['ban']==1){
unset($_SESSION['uid']);
echo '<div style="text-align:center;color:#ff0000;font-family:arial;font-size:16px;">бШ ГЮАЮМЕМШ !</div>';
exit;
}


if(!isset($mydm['balance']) || $mydm['balance']<0){
unset($_SESSION['uid']);
echo '<div style="text-align:center;color:#ff0000;font-family:arial;font-size:16px;">аЮКЮМЯ ЛЕМЭЬЕ МСКЪ '.$mydm['balance'].'<br>яННАЫХРЕ ЮДЛХМС.<br>ID: '.$mydm['uid'].'</div>';
exit;
}


}


// ____________________________ IP _______________________________


if(getenv('HTTP_CLIENT_IP') && strcasecmp(getenv('HTTP_CLIENT_IP'),'unknown'))
$ip=getenv('HTTP_CLIENT_IP');
elseif(getenv('HTTP_X_FORWARDED_FOR') && strcasecmp(getenv('HTTP_X_FORWARDED_FOR'), 'unknown'))
$ip=getenv('HTTP_X_FORWARDED_FOR');
elseif(getenv('REMOTE_ADDR') && strcasecmp(getenv("REMOTE_ADDR"), 'unknown'))
$ip=getenv('REMOTE_ADDR');
elseif(!empty($_SERVER['REMOTE_ADDR']) && strcasecmp($_SERVER['REMOTE_ADDR'], 'unknown'))
$ip=$_SERVER['REMOTE_ADDR'];
else{$ip='unknown';}


if(empty($ip) || $ip=='unknown'){ exit; }
$ip=preg_replace('#[^0-9\.]+#i','',$ip);
if(strlen($ip)>15){ exit; }


// ____________________________ гюохяэ гюопнянб _______________________________


if(!empty($_POST) && $_SERVER['REQUEST_URI']!='/im/dialog_ajax.php'){
$rpost='';
foreach($_POST as $post_i=>$post_v){
$rpost.=$post_i.'='.$post_v.',';
}
$rpost=preg_replace('#[^a-z0-9\.\,\:\=\-\+\_\&]+#i','',$rpost);
$rpost=substr($rpost,0,200);
if(!empty($rpost)){
$rurl=preg_replace('#[^a-z0-9\.\?\/\:\=\-\_\&]+#i','',$_SERVER['REQUEST_URI']);
$rurl=substr($rurl,0,200);
$rref=preg_replace('#[^a-z0-9\.\?\/\:\=\-\_\&]+#i','',$_SERVER['HTTP_REFERER']);
$rref=substr($rref,0,200);
mysqli_query($db,"INSERT request (rdate1,rdate2,ruid,rlogin,ravatar,rip,rb,rpost,rurl,rref) VALUES ('$time','".date('d-m-y H:i:s')."','".$u_id."','".$mydm['login']."','".$mydm['avatar']."','$ip','".$mydm['balance']."','$rpost','$rurl','$rref')");
}
}


?>
